grevaillot/svd_tools/headers/STM32H743x/adc1.h
/** @defgroup adc1_pcsel PCSEL ADC pre channel selection register
@{*/


#define ADC1_PCSEL_PCSEL_SHIFT		0
#define ADC1_PCSEL_PCSEL_MASK		0xfffff
/** @defgroup adc1_pcsel_pcsel PCSEL Channel x (VINP[i]) pre selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ltr1 LTR1 ADC analog watchdog 1 threshold register
@{*/


#define ADC1_LTR1_LTR1_SHIFT		0
#define ADC1_LTR1_LTR1_MASK		0x3ffffff
/** @defgroup adc1_ltr1_ltr1 LTR1 ADC analog watchdog 1 threshold low
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_lhtr1 LHTR1 ADC analog watchdog 2 threshold register
@{*/


#define ADC1_LHTR1_LHTR1_SHIFT		0
#define ADC1_LHTR1_LHTR1_MASK		0x3ffffff
/** @defgroup adc1_lhtr1_lhtr1 LHTR1 ADC analog watchdog 2 threshold low
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_sqr1 SQR1 ADC group regular sequencer ranks register 1
@{*/


#define ADC1_SQR1_SQ4_SHIFT		24
#define ADC1_SQR1_SQ4_MASK		0x1f
/** @defgroup adc1_sqr1_sq4 SQ4 ADC group regular sequencer rank 4
@{*/
/**@}*/


#define ADC1_SQR1_SQ3_SHIFT		18
#define ADC1_SQR1_SQ3_MASK		0x1f
/** @defgroup adc1_sqr1_sq3 SQ3 ADC group regular sequencer rank 3
@{*/
/**@}*/


#define ADC1_SQR1_SQ2_SHIFT		12
#define ADC1_SQR1_SQ2_MASK		0x1f
/** @defgroup adc1_sqr1_sq2 SQ2 ADC group regular sequencer rank 2
@{*/
/**@}*/


#define ADC1_SQR1_SQ1_SHIFT		6
#define ADC1_SQR1_SQ1_MASK		0x1f
/** @defgroup adc1_sqr1_sq1 SQ1 ADC group regular sequencer rank 1
@{*/
/**@}*/


#define ADC1_SQR1_L3_SHIFT		0
#define ADC1_SQR1_L3_MASK		0x0f
/** @defgroup adc1_sqr1_l3 L3 L3
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_sqr2 SQR2 ADC group regular sequencer ranks register 2
@{*/


#define ADC1_SQR2_SQ9_SHIFT		24
#define ADC1_SQR2_SQ9_MASK		0x1f
/** @defgroup adc1_sqr2_sq9 SQ9 ADC group regular sequencer rank 9
@{*/
/**@}*/


#define ADC1_SQR2_SQ8_SHIFT		18
#define ADC1_SQR2_SQ8_MASK		0x1f
/** @defgroup adc1_sqr2_sq8 SQ8 ADC group regular sequencer rank 8
@{*/
/**@}*/


#define ADC1_SQR2_SQ7_SHIFT		12
#define ADC1_SQR2_SQ7_MASK		0x1f
/** @defgroup adc1_sqr2_sq7 SQ7 ADC group regular sequencer rank 7
@{*/
/**@}*/


#define ADC1_SQR2_SQ6_SHIFT		6
#define ADC1_SQR2_SQ6_MASK		0x1f
/** @defgroup adc1_sqr2_sq6 SQ6 ADC group regular sequencer rank 6
@{*/
/**@}*/


#define ADC1_SQR2_SQ5_SHIFT		0
#define ADC1_SQR2_SQ5_MASK		0x1f
/** @defgroup adc1_sqr2_sq5 SQ5 ADC group regular sequencer rank 5
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_sqr3 SQR3 ADC group regular sequencer ranks register 3
@{*/


#define ADC1_SQR3_SQ14_SHIFT		24
#define ADC1_SQR3_SQ14_MASK		0x1f
/** @defgroup adc1_sqr3_sq14 SQ14 ADC group regular sequencer rank 14
@{*/
/**@}*/


#define ADC1_SQR3_SQ13_SHIFT		18
#define ADC1_SQR3_SQ13_MASK		0x1f
/** @defgroup adc1_sqr3_sq13 SQ13 ADC group regular sequencer rank 13
@{*/
/**@}*/


#define ADC1_SQR3_SQ12_SHIFT		12
#define ADC1_SQR3_SQ12_MASK		0x1f
/** @defgroup adc1_sqr3_sq12 SQ12 ADC group regular sequencer rank 12
@{*/
/**@}*/


#define ADC1_SQR3_SQ11_SHIFT		6
#define ADC1_SQR3_SQ11_MASK		0x1f
/** @defgroup adc1_sqr3_sq11 SQ11 ADC group regular sequencer rank 11
@{*/
/**@}*/


#define ADC1_SQR3_SQ10_SHIFT		0
#define ADC1_SQR3_SQ10_MASK		0x1f
/** @defgroup adc1_sqr3_sq10 SQ10 ADC group regular sequencer rank 10
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_sqr4 SQR4 ADC group regular sequencer ranks register 4
@{*/


#define ADC1_SQR4_SQ16_SHIFT		6
#define ADC1_SQR4_SQ16_MASK		0x1f
/** @defgroup adc1_sqr4_sq16 SQ16 ADC group regular sequencer rank 16
@{*/
/**@}*/


#define ADC1_SQR4_SQ15_SHIFT		0
#define ADC1_SQR4_SQ15_MASK		0x1f
/** @defgroup adc1_sqr4_sq15 SQ15 ADC group regular sequencer rank 15
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_dr DR ADC group regular conversion data register
@{*/


#define ADC1_DR_RDATA_SHIFT		0
#define ADC1_DR_RDATA_MASK		0xffff
/** @defgroup adc1_dr_rdata RDATA ADC group regular conversion data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_jsqr JSQR ADC group injected sequencer register
@{*/


#define ADC1_JSQR_JSQ4_SHIFT		27
#define ADC1_JSQR_JSQ4_MASK		0x1f
/** @defgroup adc1_jsqr_jsq4 JSQ4 ADC group injected sequencer rank 4
@{*/
/**@}*/


#define ADC1_JSQR_JSQ3_SHIFT		21
#define ADC1_JSQR_JSQ3_MASK		0x1f
/** @defgroup adc1_jsqr_jsq3 JSQ3 ADC group injected sequencer rank 3
@{*/
/**@}*/


#define ADC1_JSQR_JSQ2_SHIFT		15
#define ADC1_JSQR_JSQ2_MASK		0x1f
/** @defgroup adc1_jsqr_jsq2 JSQ2 ADC group injected sequencer rank 2
@{*/
/**@}*/


#define ADC1_JSQR_JSQ1_SHIFT		9
#define ADC1_JSQR_JSQ1_MASK		0x1f
/** @defgroup adc1_jsqr_jsq1 JSQ1 ADC group injected sequencer rank 1
@{*/
/**@}*/


#define ADC1_JSQR_JEXTEN_SHIFT		7
#define ADC1_JSQR_JEXTEN_MASK		0x03
/** @defgroup adc1_jsqr_jexten JEXTEN ADC group injected external trigger polarity
@{*/
/**@}*/


#define ADC1_JSQR_JEXTSEL_SHIFT		2
#define ADC1_JSQR_JEXTSEL_MASK		0x1f
/** @defgroup adc1_jsqr_jextsel JEXTSEL ADC group injected external trigger source
@{*/
/**@}*/


#define ADC1_JSQR_JL_SHIFT		0
#define ADC1_JSQR_JL_MASK		0x03
/** @defgroup adc1_jsqr_jl JL ADC group injected sequencer scan length
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ofr1 OFR1 ADC offset number 1 register
@{*/

/** ADC1_OFR1_SSATE ADC offset number 1 enable **/
#define ADC1_OFR1_SSATE		(1 << 31)

#define ADC1_OFR1_OFFSET1_CH_SHIFT		26
#define ADC1_OFR1_OFFSET1_CH_MASK		0x1f
/** @defgroup adc1_ofr1_offset1_ch OFFSET1CH ADC offset number 1 channel selection
@{*/
/**@}*/


#define ADC1_OFR1_OFFSET1_SHIFT		0
#define ADC1_OFR1_OFFSET1_MASK		0x3ffffff
/** @defgroup adc1_ofr1_offset1 OFFSET1 ADC offset number 1 offset level
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ofr2 OFR2 ADC offset number 2 register
@{*/

/** ADC1_OFR2_SSATE ADC offset number 1 enable **/
#define ADC1_OFR2_SSATE		(1 << 31)

#define ADC1_OFR2_OFFSET1_CH_SHIFT		26
#define ADC1_OFR2_OFFSET1_CH_MASK		0x1f
/** @defgroup adc1_ofr2_offset1_ch OFFSET1CH ADC offset number 1 channel selection
@{*/
/**@}*/


#define ADC1_OFR2_OFFSET1_SHIFT		0
#define ADC1_OFR2_OFFSET1_MASK		0x3ffffff
/** @defgroup adc1_ofr2_offset1 OFFSET1 ADC offset number 1 offset level
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ofr3 OFR3 ADC offset number 3 register
@{*/

/** ADC1_OFR3_SSATE ADC offset number 1 enable **/
#define ADC1_OFR3_SSATE		(1 << 31)

#define ADC1_OFR3_OFFSET1_CH_SHIFT		26
#define ADC1_OFR3_OFFSET1_CH_MASK		0x1f
/** @defgroup adc1_ofr3_offset1_ch OFFSET1CH ADC offset number 1 channel selection
@{*/
/**@}*/


#define ADC1_OFR3_OFFSET1_SHIFT		0
#define ADC1_OFR3_OFFSET1_MASK		0x3ffffff
/** @defgroup adc1_ofr3_offset1 OFFSET1 ADC offset number 1 offset level
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ofr4 OFR4 ADC offset number 4 register
@{*/

/** ADC1_OFR4_SSATE ADC offset number 1 enable **/
#define ADC1_OFR4_SSATE		(1 << 31)

#define ADC1_OFR4_OFFSET1_CH_SHIFT		26
#define ADC1_OFR4_OFFSET1_CH_MASK		0x1f
/** @defgroup adc1_ofr4_offset1_ch OFFSET1CH ADC offset number 1 channel selection
@{*/
/**@}*/


#define ADC1_OFR4_OFFSET1_SHIFT		0
#define ADC1_OFR4_OFFSET1_MASK		0x3ffffff
/** @defgroup adc1_ofr4_offset1 OFFSET1 ADC offset number 1 offset level
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_jdr1 JDR1 ADC group injected sequencer rank 1 register
@{*/


#define ADC1_JDR1_JDATA1_SHIFT		0
#define ADC1_JDR1_JDATA1_MASK		0xffffffff
/** @defgroup adc1_jdr1_jdata1 JDATA1 ADC group injected sequencer rank 1 conversion data
@{*/
/**@}*/


/**@}*/

